{
  "51-attack": {
    "term": "51% Attack",
    "definition": "A theoretical attack where an entity controlling more than 50% of the network's hash rate could potentially double-spend transactions or prevent confirmations by mining an alternative chain faster than the honest network."
  },
  "2-of-3-multisig": {
    "term": "2-of-3 Multisig",
    "definition": "A common multisignature configuration requiring 2 signatures from 3 possible signers to spend funds. This setup provides a balance between security and convenience: if one key is lost or compromised, funds remain accessible and secure."
  },
  "21-million": {
    "term": "21 Million",
    "definition": "The maximum supply of Bitcoin that will ever exist, enforced by the protocol's consensus rules and achieved through the halving schedule, with the last satoshi expected to be mined around the year 2140."
  },
  "absolute-time-lock": {
    "term": "Absolute Time Lock",
    "definition": "A time lock that prevents a transaction from being spent until a specific block height or Unix timestamp is reached, implemented using the OP_CHECKLOCKTIMEVERIFY (CLTV) opcode. Unlike relative time locks, absolute locks reference a fixed point in time rather than being relative to when the UTXO was..."
  },
  "address": {
    "term": "Address",
    "definition": "A public identifier where Bitcoin can be received, generated from a public key through hash functions. Different address types exist (P2PKH, P2SH, P2WPKH/P2WSH, P2TR) reflecting Bitcoin's evolution, with newer types offering lower fees and better privacy."
  },
  "address-reuse": {
    "term": "Address Reuse",
    "definition": "Using the same Bitcoin address for multiple transactions, which is generally discouraged for both privacy and security reasons. Reusing addresses links transactions together on the public blockchain, making it easier to trace financial activity."
  },
  "anchor-outputs": {
    "term": "Anchor Outputs",
    "definition": "A mechanism in Lightning Network that allows payment channels to be closed reliably even when on-chain fee rates have increased significantly since the channel was opened. Each commitment transaction includes small \"anchor\" outputs that either party can use to attach a child transaction with higher..."
  },
  "asic-application-specific-integrated-circuit": {
    "term": "ASIC (Application-Specific Integrated Circuit)",
    "definition": "Specialized hardware designed and manufactured specifically for Bitcoin mining, optimized to perform SHA-256 hash calculations as efficiently as possible. ASICs are orders of magnitude more efficient than general-purpose CPUs or GPUs, making other hardware economically unviable for mining."
  },
  "atomic-swap": {
    "term": "Atomic Swap",
    "definition": "A peer-to-peer exchange of cryptocurrencies between two parties without the need for a trusted third party or centralized exchange. Atomic swaps use hash time-locked contracts (HTLCs) to ensure that either both parties receive their funds or neither does, enabling trustless trading across different..."
  },
  "api-application-programming-interface": {
    "term": "API (Application Programming Interface)",
    "definition": "A set of protocols and tools that allow applications to communicate with Bitcoin nodes, typically via JSON-RPC. The Bitcoin Core RPC API provides methods to query blockchain data, create and broadcast transactions, manage wallets, and monitor network status."
  },
  "aml-anti-money-laundering": {
    "term": "AML (Anti-Money Laundering)",
    "definition": "Government-imposed regulations on Bitcoin exchanges requiring them to collect personal data in the name of preventing crime. These rules compromise privacy and weaken security for all users, trading individual sovereignty for government control."
  },
  "ark": {
    "term": "Ark",
    "definition": "A proposed Bitcoin Layer 2 scaling solution designed to allow fast, off-chain Bitcoin transactions while reducing liquidity constraints seen in other Layer 2 protocols. Ark enables users to send and receive bitcoin without requiring complex onboarding or liquidity locks. ---"
  },
  "batching": {
    "term": "Batching",
    "definition": "Combining multiple payments into a single transaction to reduce fees by sharing the fixed overhead costs across many recipients. Multiple outputs are included in one transaction, significantly reducing the total bytes and thus fees paid."
  },
  "base58": {
    "term": "Base58",
    "definition": "An encoding scheme used in legacy Bitcoin addresses that provides a human-readable format while minimizing transcription errors. It's similar to Base64 but excludes visually ambiguous characters (0, O, I, l)."
  },
  "bech32": {
    "term": "Bech32",
    "definition": "A checksummed base32 encoding format introduced with SegWit (BIP 173) that provides better error detection than Base58Check. Addresses start with bc1 for mainnet or tb1 for testnet, and use only lowercase letters and numbers. An updated version called Bech32m (BIP 350) is used for Taproot addresses."
  },
  "block": {
    "term": "Block",
    "definition": "A collection of transactions grouped together and permanently added to the blockchain approximately every 10 minutes. Each block contains a header with proof-of-work, a coinbase transaction that creates new Bitcoin, and typically thousands of user transactions."
  },
  "blockchain": {
    "term": "Blockchain",
    "definition": "A distributed, append-only ledger of all Bitcoin transactions maintained by thousands of independent nodes worldwide. Blocks are cryptographically linked in chronological order, making historical data tamper-evident and immutable."
  },
  "block-header": {
    "term": "Block Header",
    "definition": "The 80-byte metadata at the start of each block that miners hash repeatedly during proof-of-work. It contains six fields: version number, previous block hash, merkle root, timestamp, difficulty target, and nonce."
  },
  "block-height": {
    "term": "Block Height",
    "definition": "The number of blocks in the chain before a given block, serving as a sequential identifier for blocks. The genesis block has height 0, and each subsequent block increments the height by one."
  },
  "block-reward": {
    "term": "Block Reward",
    "definition": "The amount of new Bitcoin created and awarded to miners for successfully mining a block, also called the block subsidy. Currently 3.125 BTC after the 2024 halving, this reward halves approximately every four years (210,000 blocks) until all 21 million Bitcoin are mined around 2140."
  },
  "block-size": {
    "term": "Block Size",
    "definition": "The size of a block measured in bytes or weight units, which is limited by consensus rules to prevent blockchain bloat. Bitcoin has a 1 MB base block size limit, but the SegWit upgrade introduced weight units that allow blocks to effectively reach ~4 MB when containing mostly SegWit transactions."
  },
  "block-time": {
    "term": "Block Time",
    "definition": "The average time between consecutive blocks, which Bitcoin targets at 10 minutes through automatic difficulty adjustment. This target represents a tradeoff between confirmation speed and security."
  },
  "block-template": {
    "term": "Block Template",
    "definition": "A data structure containing selected transactions and partially-filled block header fields that miners use to construct candidate blocks. Mining pools generate block templates by selecting transactions from the mempool (typically prioritizing by fee rate), computing the merkle root, and providing..."
  },
  "bolt-basis-of-lightning-technology": {
    "term": "BOLT (Basis of Lightning Technology)",
    "definition": "The technical specifications that define the Lightning Network protocol, similar to how RFCs define internet protocols. BOLT documents specify everything from the peer-to-peer message format to channel construction, payment routing, and invoice encoding."
  },
  "bip-bitcoin-improvement-proposal": {
    "term": "BIP (Bitcoin Improvement Proposal)",
    "definition": "A design document that proposes changes, additions, or informational content for the Bitcoin ecosystem, following a structured process for community review. BIPs are categorized as Standards Track (protocol changes), Informational, or Process documents."
  },
  "bitcoin-client": {
    "term": "Bitcoin Client",
    "definition": "Software that enables users to send and receive bitcoin. Bitcoin Core is the most widely used and trusted client, though others exist with varying features."
  },
  "bitcoin-core": {
    "term": "Bitcoin Core",
    "definition": "The reference software for Bitcoin, developed and maintained by the open-source Bitcoin community. It acts as the most trusted and widely used implementation of the Bitcoin protocol."
  },
  "bitcoin-etf": {
    "term": "Bitcoin ETF",
    "definition": "A financial product that tracks the price of bitcoin, allowing investors and funds to gain exposure to bitcoin's price movements without directly owning or managing bitcoin itself."
  },
  "bitcoin-network": {
    "term": "Bitcoin Network",
    "definition": "A global, decentralized system of nodes that broadcasts transactions and secures the blockchain, making Bitcoin's decentralized ledger possible."
  },
  "bitcoin-treasury-company": {
    "term": "Bitcoin Treasury Company",
    "definition": "Companies that place bitcoin at the center of their balance sheet strategy, unlocking access to capital and absorbing bitcoin's supply as a form of capital preservation."
  },
  "block-subsidy": {
    "term": "Block Subsidy",
    "definition": "The new bitcoin that miners receive as part of the block reward for successfully mining a new block. It decreases over time through halvings and is the primary way new bitcoin enters circulation."
  },
  "brc-20-tokens": {
    "term": "BRC-20 Tokens",
    "definition": "Experimental, fungible tokens on Bitcoin created using ordinal inscriptions, similar to Ethereum's ERC-20 tokens. They are an inefficient use of Bitcoin's block space, often leading to higher transaction fees and network congestion."
  },
  "btc": {
    "term": "BTC",
    "definition": "The ticker symbol for bitcoin, representing the asset in trading pairs. It's also sometimes used as shorthand for the Bitcoin Core software. ---"
  },
  "cltv-checklocktimeverify": {
    "term": "CLTV (CheckLockTimeVerify)",
    "definition": "An opcode (OP_CHECKLOCKTIMEVERIFY) that enforces absolute time locks by making a transaction invalid if spent before a specified block height or Unix timestamp. Introduced in BIP 65, CLTV enables time-locked contracts where funds cannot be moved until a future date regardless of who holds the keys."
  },
  "coinbase-transaction": {
    "term": "Coinbase Transaction",
    "definition": "The first transaction in every block, which has no inputs and creates new Bitcoin as the block reward plus collected transaction fees. Miners construct the coinbase transaction to pay themselves, and it's the only transaction type that can create new coins."
  },
  "coin-selection": {
    "term": "Coin Selection",
    "definition": "The process of choosing which UTXOs to spend when creating a transaction, which significantly impacts fees, privacy, and future UTXO management. Various algorithms exist: largest-first minimizes input count but creates large change outputs; smallest-first consolidates dust but increases fees;..."
  },
  "coinjoin": {
    "term": "CoinJoin",
    "definition": "A privacy technique where multiple users combine their transactions into a single transaction, making it difficult for blockchain analysts to determine which inputs correspond to which outputs. Each participant signs only their own inputs, so no one can steal funds."
  },
  "commitment-transaction": {
    "term": "Commitment Transaction",
    "definition": "In Lightning Network, a pre-signed transaction that represents the current state of a payment channel and can be broadcast to close the channel unilaterally. Both channel parties hold their own version of the commitment transaction, which pays out the current balance distribution."
  },
  "confirmation": {
    "term": "Confirmation",
    "definition": "When a transaction is included in a block that is added to the blockchain, it receives its first confirmation; each subsequent block adds another confirmation. More confirmations increase certainty that the transaction is final because reversing it would require re-mining all those blocks."
  },
  "consensus": {
    "term": "Consensus",
    "definition": "Agreement among network participants about the current state of the blockchain, including which transactions are valid and which chain of blocks is authoritative. Bitcoin achieves consensus through proof-of-work and the longest chain rule: nodes accept the valid chain with the most accumulated..."
  },
  "consensus-rules": {
    "term": "Consensus Rules",
    "definition": "The set of rules that all Bitcoin nodes must follow to validate transactions and blocks, forming the foundation of network agreement. These include rules about block structure, transaction format, signature validity, coin supply, and timing."
  },
  "censorship-resistance": {
    "term": "Censorship Resistance",
    "definition": "The ability to make transactions that cannot be blocked, reversed, or seized by any central authority, government, or corporation. Bitcoin achieves this through decentralization: thousands of independent miners and nodes mean no single entity controls which transactions are included in blocks."
  },
  "change-output": {
    "term": "Change Output",
    "definition": "A transaction output that sends excess funds back to the sender, created because Bitcoin's UTXO model requires spending entire outputs. When input value exceeds the payment amount plus fees, the difference must be explicitly sent somewhere, typically a new address controlled by the sender."
  },
  "cpfp-child-pays-for-parent": {
    "term": "CPFP (Child Pays For Parent)",
    "definition": "A fee bumping technique where a new transaction (the child) spends an unconfirmed output from a stuck transaction (the parent) with a high enough fee to make mining both transactions profitable."
  },
  "csv-checksequenceverify": {
    "term": "CSV (CheckSequenceVerify)",
    "definition": "An opcode (OP_CHECKSEQUENCEVERIFY) that enforces relative time locks, preventing a UTXO from being spent until a specified number of blocks or time has passed since it was confirmed."
  },
  "compact-block": {
    "term": "Compact Block",
    "definition": "A block relay protocol (BIP 152) that dramatically reduces bandwidth by sending only block headers and short transaction IDs instead of full transaction data. Since most transactions in a new block are already in a node's mempool, the node can reconstruct the full block locally using these short..."
  },
  "chain-reorganization": {
    "term": "Chain Reorganization",
    "definition": "A process where a Bitcoin client discovers a longer chain of blocks, replacing the previously recognized chain. Blocks excluded during this process become \"orphaned blocks.\""
  },
  "checktemplateverify-ctv": {
    "term": "CheckTemplateVerify (CTV)",
    "definition": "A proposed Bitcoin opcode enabling basic covenants by allowing users to predefine how their bitcoin can be spent in future transactions. Through transaction templates, CTV can enforce specific spending paths, enhancing security for applications like vault wallets and improving scalability."
  },
  "cold-storage-wallet": {
    "term": "Cold Storage Wallet",
    "definition": "An offline Bitcoin wallet that isn't connected to the internet, providing enhanced security against hacking and theft. Typically used for long-term storage, it keeps private keys isolated from potential online threats. Hardware wallets and paper wallets are common forms of cold storage."
  },
  "covenants": {
    "term": "Covenants",
    "definition": "A proposed type of smart contract that allows users to set conditions or restrictions on how their bitcoin can be spent after the initial transaction. By embedding specific rules, covenants can add layers of control over future transactions, useful for applications like vaults or multi-stage..."
  },
  "cross-input-signature-aggregation-cisa": {
    "term": "Cross-Input Signature Aggregation (CISA)",
    "definition": "A proposed Bitcoin upgrade to reduce transaction size by combining multiple input signatures into a single signature. For example, if Alice spends two Taproot UTXOs, instead of providing separate signatures for each, CISA would aggregate them into one 16-vbyte MuSig-style signature, lowering fees..."
  },
  "cryptocurrency": {
    "term": "Cryptocurrency",
    "definition": "A broad category of digital or virtual currencies that rely on cryptography to secure transactions and control the issuance of new units. The first and most notable cryptocurrency is Bitcoin, created by Satoshi Nakamoto in 2009."
  },
  "cryptography": {
    "term": "Cryptography",
    "definition": "The use of complex mathematics to secure data. Bitcoin relies on cryptographic techniques to protect funds, verify ownership, and ensure the integrity of the blockchain."
  },
  "cypherpunks": {
    "term": "Cypherpunks",
    "definition": "Activists who advocate for using cryptography to protect privacy and personal freedom. They were members of the now-defunct Cypherpunk mailing list, active in the 1990s. Their work laid the foundation for privacy-preserving technologies like Bitcoin."
  },
  "channel": {
    "term": "Channel",
    "definition": "A payment channel between two Lightning Network nodes that enables instant, low-cost payments without broadcasting each transaction to the blockchain. Channels are created by locking Bitcoin in a 2-of-2 multisig address on-chain, then updating balance distributions off-chain through signed..."
  },
  "channel-capacity": {
    "term": "Channel Capacity",
    "definition": "The total amount of Bitcoin locked in a Lightning payment channel, representing the maximum value that can flow through it at any moment. Capacity is set when the channel is opened and equals the sum of both parties' contributions (though single-funded channels are common)."
  },
  "channel-closing": {
    "term": "Channel Closing",
    "definition": "The process of finalizing a Lightning payment channel by broadcasting the final state to the Bitcoin blockchain, which settles the channel balance and unlocks funds. Cooperative closes are preferred: both parties agree on the final balance and sign a closing transaction with minimal fees and no..."
  },
  "channel-funding": {
    "term": "Channel Funding",
    "definition": "The process of opening a Lightning payment channel by creating an on-chain transaction that locks Bitcoin in a 2-of-2 multisig address controlled by both channel parties. The funding transaction must be confirmed on the blockchain before the channel becomes usable, which typically takes 3-6..."
  },
  "channel-state": {
    "term": "Channel State",
    "definition": "The current balance distribution in a Lightning payment channel, representing how much each party would receive if the channel were closed immediately. State is updated off-chain through signed commitment transactions every time a payment flows through the channel."
  },
  "cooperative-close": {
    "term": "Cooperative Close",
    "definition": "The preferred method of closing a Lightning payment channel where both parties agree on the final balance and sign a single closing transaction. Unlike force closes, cooperative closes have no time delays, lower fees, and settle immediately once confirmed on-chain."
  },
  "dao-decentralized-autonomous-organization": {
    "term": "DAO (Decentralized Autonomous Organization)",
    "definition": "A Decentralized Autonomous Organization (DAO) is governed by rules encoded in smart contracts, eliminating the need for centralized control. Bitcoin doesn't rely on DAOs, as it operates independently."
  },
  "dca-dollar-cost-averaging": {
    "term": "DCA (Dollar-Cost Averaging)",
    "definition": "A strategy where a fixed amount of money is used to buy bitcoin at regular intervals, smoothing out volatility by ignoring short-term price movements."
  },
  "dex-decentralized-exchange": {
    "term": "DEX (Decentralized Exchange)",
    "definition": "A decentralized exchange that allows users to trade cryptocurrencies without relying on a centralized entity. In Bitcoin, DEXs ensure users maintain control over their private keys during trades."
  },
  "decentralization": {
    "term": "Decentralization",
    "definition": "The distribution of control, decision-making, and infrastructure across many independent participants rather than a single central authority. Bitcoin achieves this through open-source code that anyone can audit, distributed mining across thousands of operations worldwide, and permissionless node..."
  },
  "derivation-path": {
    "term": "Derivation Path",
    "definition": "A sequence of indices that specifies how to derive a specific key from a master seed in an HD (hierarchical deterministic) wallet, enabling organized key management. The format m/purpose'/coin'/account'/change/index creates a tree structure where the apostrophe indicates hardened derivation."
  },
  "descriptors": {
    "term": "Descriptors",
    "definition": "A standardized format (BIP 380-386) for describing how to derive addresses and spending conditions from keys, providing more complete wallet backup information than keys alone. Descriptors specify not just which keys to use but how to use them: the script type, derivation paths, and any multi-party..."
  },
  "datum": {
    "term": "DATUM",
    "definition": "A decentralized mining protocol that allows individual miners to construct their own block templates rather than accepting whatever the pool provides. This gives miners control over which transactions to include, addressing concerns about pool-level transaction censorship and centralization of..."
  },
  "difficulty": {
    "term": "Difficulty",
    "definition": "A measure of how computationally hard it is to find a valid block hash, automatically adjusted every 2016 blocks (roughly two weeks) to maintain approximately 10-minute block intervals. When blocks are found faster than target, difficulty increases; when slower, it decreases."
  },
  "difficulty-target": {
    "term": "Difficulty Target",
    "definition": "The maximum hash value that is considered valid for a block, expressed as a 256-bit number that miners must beat. Miners repeatedly hash block headers with different nonces until finding a hash numerically below this target. Lower targets are harder to hit and represent higher difficulty."
  },
  "double-spend": {
    "term": "Double Spend",
    "definition": "An attempt to spend the same Bitcoin twice by creating two conflicting transactions that both reference the same UTXO. Bitcoin's blockchain consensus mechanism prevents this by establishing a single authoritative transaction history."
  },
  "digital-cash": {
    "term": "Digital Cash",
    "definition": "Currency in a digital format, designed to mimic the characteristics of physical cash, such as privacy and peer-to-peer transactions. Bitcoin is often considered digital cash because it enables direct, trustless transfers between users without intermediaries."
  },
  "digital-money": {
    "term": "Digital Money",
    "definition": "Any form of money stored and transacted electronically. This can include both centralized forms like bank deposits and decentralized currencies like Bitcoin, which operates without a central authority."
  },
  "digital-signature": {
    "term": "Digital Signature",
    "definition": "A cryptographic proof that can be attached to a message to show that the sender is the owner of a private key corresponding to some public key while keeping the private key secret. It works by taking the hash of the message and then encrypting the hash with the private key."
  },
  "distributed-ledger": {
    "term": "Distributed Ledger",
    "definition": "Bitcoin's distributed ledger, the blockchain, is stored across nodes worldwide. It's permissionless, meaning anyone can participate and verify transactions without needing approval."
  },
  "dont-trust-verify": {
    "term": "Don't Trust, Verify",
    "definition": "A nod to Bitcoin's trustless nature, where users can verify transactions and ownership themselves, rather than relying on third parties or intermediaries."
  },
  "dust": {
    "term": "Dust",
    "definition": "A transaction output so small that the fee required to spend it would exceed or approach its value, making it economically irrational to use. The dust threshold depends on fee rates but is typically around 546 satoshis for standard outputs and 294 satoshis for SegWit outputs."
  },
  "dyor-do-your-own-research": {
    "term": "DYOR (Do Your Own Research)",
    "definition": "\"Do Your Own Research,\" encouraging individuals to do their own due diligence about Bitcoin or any investible asset before making decisions. ---"
  },
  "ecdsa-elliptic-curve-digital-signature-algorithm": {
    "term": "ECDSA (Elliptic Curve Digital Signature Algorithm)",
    "definition": "The original cryptographic signature algorithm used in Bitcoin, based on the secp256k1 elliptic curve. ECDSA signatures prove ownership of private keys without revealing them, enabling secure authorization of transactions."
  },
  "ecdh-elliptic-curve-diffie-hellman": {
    "term": "ECDH (Elliptic Curve Diffie-Hellman)",
    "definition": "A key exchange protocol that allows two parties to establish a shared secret over an insecure channel using elliptic curve cryptography. In Lightning Network, ECDH is used in onion routing (Sphinx protocol) to derive shared secrets between each hop without revealing them to other nodes in the path."
  },
  "ecash": {
    "term": "eCash",
    "definition": "An early form of digital currency developed in the 1980s by cryptographer David Chaum. It allowed for anonymous electronic transactions but required a central issuer. While eCash itself did not achieve widespread adoption, its principles influenced the development of later decentralized digital..."
  },
  "electronic-cash": {
    "term": "Electronic Cash",
    "definition": "A general term for money in digital form that can be transferred electronically, aiming to replicate the experience of using physical cash in the digital realm. Bitcoin is often regarded as true electronic cash due to its decentralized and peer-to-peer nature."
  },
  "electronic-money": {
    "term": "Electronic Money",
    "definition": "Digital representations of fiat currency that can be transferred electronically. Unlike Bitcoin, e-money typically requires a centralized entity, like a bank or payment processor, to manage transactions and balances."
  },
  "encryption": {
    "term": "Encryption",
    "definition": "The process of converting information into a code to prevent unauthorized access. In Bitcoin, encryption is used to secure private keys and ensure the integrity of transactions."
  },
  "encryption-algorithm": {
    "term": "Encryption Algorithm",
    "definition": "A piece of software that transforms readable data into an unreadable format using an encryption key. Only someone with the matching decryption key can reverse the process. In Bitcoin, encryption algorithms are used to secure transactions and protect sensitive information."
  },
  "exchange": {
    "term": "Exchange",
    "definition": "A platform where fiat currency is exchanged for bitcoin and vice versa. It serves as an onramp for buying bitcoin with fiat and an offramp for converting bitcoin back to fiat. Centralized exchanges often require KYC, while decentralized exchanges (DEXs) enable peer-to-peer trading without..."
  },
  "exchange-volume": {
    "term": "Exchange Volume",
    "definition": "The total amount of bitcoin traded on an exchange within a specific timeframe, indicating market activity and liquidity. ---"
  },
  "fee-bumping": {
    "term": "Fee Bumping",
    "definition": "Techniques to increase the effective fee of an unconfirmed transaction to speed up confirmation when the original fee is too low for current network conditions. The two main methods are RBF (Replace-by-Fee), which replaces the stuck transaction with a higher-fee version, and CPFP (Child Pays for..."
  },
  "fee-rate": {
    "term": "Fee Rate",
    "definition": "The fee paid per virtual byte (vByte) of transaction size, expressed in satoshis per vByte (sat/vB), which determines a transaction's priority for inclusion in blocks. Miners typically sort transactions by fee rate and fill blocks from highest to lowest, so higher rates mean faster confirmation."
  },
  "force-close": {
    "term": "Force Close",
    "definition": "Unilaterally closing a Lightning payment channel by broadcasting your latest commitment transaction to the Bitcoin blockchain without the counterparty's cooperation. Force closes are necessary when the other party is offline, unresponsive, or attempting fraud, but they're more expensive and slower..."
  },
  "fiat": {
    "term": "Fiat",
    "definition": "Government-issued money that holds value because governments mandate its use for taxes and as legal tender. Stronger fiat currencies like the U.S. dollar or euro hold value relative to other fiat currencies but are rapidly losing value against hard assets like Bitcoin due to inflation."
  },
  "finality": {
    "term": "Finality",
    "definition": "The assurance that a confirmed transaction cannot be reversed or altered, which in Bitcoin is probabilistic rather than absolute. Each additional confirmation makes reversal exponentially more difficult and expensive."
  },
  "fork": {
    "term": "Fork",
    "definition": "A divergence in the blockchain where two or more competing chains temporarily or permanently coexist, which can occur naturally or through protocol changes. Temporary forks happen when two miners find valid blocks simultaneously; the network resolves this by eventually building on one chain,..."
  },
  "full-node": {
    "term": "Full Node",
    "definition": "A Bitcoin node that independently validates every transaction and block against consensus rules, maintaining a complete copy of the blockchain without trusting any external source. Full nodes download and verify ~600GB+ of historical data during initial sync, then validate new blocks as they..."
  },
  "genesis-block": {
    "term": "Genesis Block",
    "definition": "The first block in the Bitcoin blockchain (block height 0), created by Satoshi Nakamoto on January 3, 2009. The coinbase transaction famously includes the text \"The Times 03/Jan/2009 Chancellor on brink of second bailout for banks,\" both proving the block wasn't pre-mined before that date and..."
  },
  "gossip-protocol": {
    "term": "Gossip Protocol",
    "definition": "The peer-to-peer mechanism by which Bitcoin nodes share information about new blocks, transactions, and network addresses with their connected peers. When a node receives valid new data, it announces it to peers who haven't seen it yet, creating a flooding pattern where information propagates..."
  },
  "gpu-graphics-processing-unit": {
    "term": "GPU (Graphics Processing Unit)",
    "definition": "Specialized hardware originally used for video rendering. Early Bitcoin miners used GPUs to mine blocks, but they've since been replaced by ASICs, which are orders of magnitude more efficient for Bitcoin mining. ---"
  },
  "halving": {
    "term": "Halving",
    "definition": "An event that occurs every 210,000 blocks (approximately every four years) where the block reward paid to miners is cut in half, reducing Bitcoin's inflation rate. This mechanism is central to Bitcoin's monetary policy, creating a predictable and diminishing supply schedule that asymptotically..."
  },
  "hash": {
    "term": "Hash",
    "definition": "A cryptographic function that takes any input and produces a fixed-size output (digest) that appears random but is deterministic: the same input always produces the same output. Bitcoin uses SHA-256 for proof-of-work and transaction IDs, and RIPEMD-160 combined with SHA-256 for address generation."
  },
  "hash-rate": {
    "term": "Hash Rate",
    "definition": "The total computational power dedicated to Bitcoin mining, measured in hashes per second, representing the network's security level. The network currently operates at approximately 500-700 EH/s (exahashes per second, or 10^18 hashes per second)."
  },
  "hashing": {
    "term": "Hashing",
    "definition": "The process of transforming data into a fixed-length output using a cryptographic algorithm. In Bitcoin, hashing ensures that data hasn't been altered, and it secures block creation in mining."
  },
  "hard-fork": {
    "term": "Hard Fork",
    "definition": "A protocol change that loosens consensus rules, making previously invalid blocks or transactions valid, which is not backward-compatible. Nodes that don't upgrade will reject new blocks as invalid, potentially creating a permanent chain split where two incompatible networks exist."
  },
  "hd-wallet-hierarchical-deterministic-wallet": {
    "term": "HD Wallet (Hierarchical Deterministic Wallet)",
    "definition": "A wallet architecture (BIP 32) that generates all keys from a single master seed, typically represented as a 12-24 word mnemonic phrase for backup. The hierarchical structure allows deriving billions of addresses in an organized tree, with branches for different accounts, purposes (receiving vs."
  },
  "hardware-wallet": {
    "term": "Hardware Wallet",
    "definition": "A physical device used to store private keys securely offline, providing protection from online hacks or malware. Hardware wallets are a form of cold storage and are widely used by Bitcoin holders for long-term storage, ensuring that their private keys remain safe from unauthorized access."
  },
  "htlc-hash-time-locked-contract": {
    "term": "HTLC (Hash Time-Locked Contract)",
    "definition": "A conditional payment contract that forms the foundation of Lightning Network and atomic swaps, combining a hash lock with a time lock. The payment can only be claimed by revealing a secret (preimage) that hashes to a known value, and it automatically refunds to the sender if not claimed before the..."
  },
  "ibd-initial-block-download": {
    "term": "IBD (Initial Block Download)",
    "definition": "The process of downloading and validating the entire blockchain history when first starting a Bitcoin full node, which can take hours to days depending on hardware and bandwidth. During IBD, the node downloads all ~600GB+ of block data, verifies every signature, checks all consensus rules, and..."
  },
  "input": {
    "term": "Input",
    "definition": "A reference to a previous transaction output (UTXO) that is being consumed in a new transaction, essentially pointing to where the funds came from. Each input contains the previous transaction's ID, the output index being spent, and a script (or witness data) proving authorization to spend those..."
  },
  "immutable": {
    "term": "Immutable",
    "definition": "Unchangeable. In Bitcoin, once a transaction is confirmed and added to the blockchain, it cannot be altered or removed, ensuring the integrity of the timechain."
  },
  "inscriptions": {
    "term": "Inscriptions",
    "definition": "Data embedded in individual satoshis using the Ordinals protocol, allowing users to attach arbitrary content, such as text, images, or other files, directly onto Bitcoin's blockchain."
  },
  "inflation": {
    "term": "Inflation",
    "definition": "The general rise in prices, which is typically caused by an increase in the money supply. Bitcoin's fixed supply makes it resistant to inflation, unlike fiat currencies that are regularly inflated."
  },
  "intrinsic-value": {
    "term": "Intrinsic Value",
    "definition": "Traditionally refers to the non-monetary use of an asset, like gold's value stemming from its physical properties, rarity, and the effort required to extract it. In contrast, Bitcoin's value doesn't come from physical use but from its mathematical scarcity, robust security protocols, and..."
  },
  "invoice": {
    "term": "Invoice",
    "definition": "A payment request in Lightning Network encoded as a BOLT11 string that contains all information needed to make a payment. Invoices typically start with lnbc for mainnet (or lntb for testnet), followed by an amount, and include the payment hash, recipient's node public key, expiry time, routing..."
  },
  "key-pair": {
    "term": "Key Pair",
    "definition": "A cryptographic pair consisting of a private key (a 256-bit secret number) and its corresponding public key (derived through elliptic curve multiplication). The private key signs transactions to prove ownership, while the public key allows anyone to verify those signatures without learning the..."
  },
  "joinmarket": {
    "term": "JoinMarket",
    "definition": "A decentralized coinjoin implementation that enhances Bitcoin privacy by allowing users to mix their coins with others, making transaction history harder to trace. Unlike centralized mixers, JoinMarket operates as a marketplace where \"makers\" provide liquidity for coinjoins and \"takers\" initiate..."
  },
  "just-in-time-jit-mining": {
    "term": "Just-In-Time (JIT) Mining",
    "definition": "A strategy where miners delay finalizing a block until the last possible moment to include the most profitable transactions. By waiting until just before broadcasting a block, miners can prioritize high-fee transactions that were submitted moments earlier, maximizing their earnings."
  },
  "keysend": {
    "term": "Keysend",
    "definition": "A Lightning Network payment method that allows sending payments without requiring an invoice from the recipient. Instead of the receiver generating a payment hash and preimage (as with standard invoices), the sender generates the preimage themselves and includes it in the encrypted onion payload."
  },
  "kyc-know-your-customer": {
    "term": "KYC (Know Your Customer)",
    "definition": "A regulation that requires financial institutions, including Bitcoin exchanges, to verify the identity of their users by collecting personal information. While KYC supposedly aims to prevent financial crimes, it undermines user privacy and conflicts with Bitcoin's principles of decentralization and..."
  },
  "lifo-last-in-first-out": {
    "term": "LIFO (Last In, First Out)",
    "definition": "A data structure principle where the most recently added item is the first to be removed, like a stack of plates. Bitcoin Script uses a LIFO stack: operations push data onto the top and pop data from the top."
  },
  "little-endian": {
    "term": "Little Endian",
    "definition": "A byte ordering format where the least significant byte is stored first (at the lowest memory address). Bitcoin uses little endian for most internal data structures, including transaction version numbers, input/output counts, satoshi amounts, lock times, and sequence numbers."
  },
  "layer-2": {
    "term": "Layer 2",
    "definition": "Secondary protocols built on top of Bitcoin's base layer, designed to improve scalability, reduce transaction fees, and increase speed, all while leveraging Bitcoin's security. The Lightning Network is the most prominent Layer 2 solution for Bitcoin."
  },
  "light-client": {
    "term": "Light Client",
    "definition": "A Bitcoin application that interacts with the Bitcoin network by querying nodes for specific transaction and block information, but does not download and store the entire blockchain."
  },
  "lightning-network": {
    "term": "Lightning Network",
    "definition": "A second-layer payment protocol built on top of Bitcoin that enables instant, high-volume, low-cost transactions through a network of payment channels. Instead of recording every payment on the blockchain, Lightning users open channels by locking Bitcoin in 2-of-2 multisig addresses, then exchange..."
  },
  "locktime": {
    "term": "Locktime",
    "definition": "A transaction-level field (nLockTime) that prevents the transaction from being valid until a specified block height or Unix timestamp is reached. When set to a block height (values < 500,000,000) or timestamp (values >= 500,000,000), nodes will not relay or mine the transaction until that condition..."
  },
  "mainnet": {
    "term": "Mainnet",
    "definition": "The production Bitcoin network where real Bitcoin with actual monetary value is transacted, as opposed to test networks used for development. Mainnet addresses start with \"1\" (legacy), \"3\" (P2SH), or \"bc1\" (SegWit/Taproot), distinguishing them from testnet addresses."
  },
  "mempool": {
    "term": "Mempool",
    "definition": "The waiting room for unconfirmed Bitcoin transactions. See Mempool (Memory Pool) for the full definition."
  },
  "mempool-memory-pool": {
    "term": "Mempool (Memory Pool)",
    "definition": "The collection of valid, unconfirmed transactions that a node has received and is holding in memory, waiting to be included in a block. Each node maintains its own mempool, and they may differ slightly based on when transactions were received and node-specific policies."
  },
  "medium-of-exchange": {
    "term": "Medium Of Exchange",
    "definition": "One of the three primary functions of money, and arguably the most closely aligned with the definition of money. It refers to an asset or currency used to facilitate trade between parties without the need for bartering."
  },
  "metal-backups": {
    "term": "Metal Backups",
    "definition": "The use of durable, fireproof, and waterproof metal sheets or plates to store recovery seed phrases or private keys. Unlike paper backups, metal backups offer long-term resilience against physical damage, providing extra security for Bitcoin holders who need to protect their keys from destruction..."
  },
  "merkle-root": {
    "term": "Merkle Root",
    "definition": "A single hash that cryptographically summarizes all transactions in a block, created by repeatedly hashing pairs of transaction hashes in a tree structure until one root remains. The merkle root is included in the 80-byte block header, allowing the entire block's transactions to be verified from..."
  },
  "merkle-tree": {
    "term": "Merkle Tree",
    "definition": "A binary tree structure where each leaf node is a hash of a transaction, and each parent node is the hash of its two children combined, ultimately producing a single root hash. This structure enables efficient proofs of inclusion: proving a transaction is in a block only requires log₂(n) hashes..."
  },
  "mast-merkle-abstract-syntax-tree": {
    "term": "MAST (Merkle Abstract Syntax Tree)",
    "definition": "A technique implemented in Taproot that represents multiple spending conditions as leaves in a Merkle tree, with only the executed path revealed when spending. This dramatically improves privacy because unused conditions remain hidden."
  },
  "musig": {
    "term": "MuSig",
    "definition": "A multi-signature scheme using Schnorr signatures that allows multiple parties to create a single aggregated signature indistinguishable from a regular single-key signature. Unlike traditional multisig (which requires listing all public keys and signatures), MuSig combines keys and signatures..."
  },
  "mpp-multi-part-payment": {
    "term": "MPP (Multi-Part Payment)",
    "definition": "A Lightning Network feature that allows splitting a large payment into multiple smaller parts that route independently through different paths, then recombine at the destination. This improves payment success rates by utilizing multiple channels' liquidity simultaneously and enables payments larger..."
  },
  "miniscript": {
    "term": "Miniscript",
    "definition": "A structured language for writing Bitcoin Scripts that is easier to analyze, compose, and reason about than raw Script. Miniscript maps to a subset of valid Bitcoin Script but provides guarantees about spending conditions, costs, and required signatures that would be difficult to determine from raw..."
  },
  "miner": {
    "term": "Miner",
    "definition": "An individual or entity that participates in Bitcoin mining by dedicating computational power to solve proof-of-work puzzles. Miners collect transactions from the mempool, construct candidate blocks, and repeatedly hash block headers searching for a valid hash below the difficulty target."
  },
  "mining": {
    "term": "Mining",
    "definition": "The process of adding new blocks to the Bitcoin blockchain through proof-of-work computation. Mining serves two critical functions: processing and validating transactions, and issuing new bitcoin according to the predetermined supply schedule."
  },
  "mining-pool": {
    "term": "Mining Pool",
    "definition": "A collective of miners who combine their computational power and share block rewards proportionally to each member's contributed work. Pools reduce payout variance: instead of rarely winning large rewards, miners receive frequent smaller payments based on submitted shares."
  },
  "mixer": {
    "term": "Mixer",
    "definition": "A service that obfuscates transaction data by blending bitcoin from different users, making it difficult to trace the movement of specific coins on the blockchain. While they enhance privacy, mixers are frequently targeted by governments and the surveillance state, which seek to undermine financial..."
  },
  "money": {
    "term": "Money",
    "definition": "A means to transact and purchase goods and services, functioning as a medium of exchange. It is a market good that is acquired not for its own sake, but as a tool to facilitate the acquisition of other goods."
  },
  "mt-gox": {
    "term": "Mt. Gox",
    "definition": "Bitcoin's first major exchange and a pivotal platform in its early years. Originally a marketplace for Magic: The Gathering cards, it became notorious after a massive security breach led to the loss of 850,000 bitcoin. Mt. Gox's collapse highlighted the importance of secure, self-custodied bitcoin."
  },
  "multisig-multi-signature": {
    "term": "Multisig (Multi-Signature)",
    "definition": "A Bitcoin script pattern requiring multiple cryptographic signatures to authorize spending, providing enhanced security and enabling shared custody arrangements. Common configurations include 2-of-3 (any two of three keyholders can spend), 3-of-5 (majority required), or 2-of-2 (both parties must..."
  },
  "node": {
    "term": "Node",
    "definition": "A computer running Bitcoin software that participates in the network by validating transactions and blocks, relaying data to peers, and maintaining its own view of the blockchain. Full nodes verify everything independently against consensus rules, while lightweight (SPV) nodes trust others for some..."
  },
  "nakamoto-consensus": {
    "term": "Nakamoto Consensus",
    "definition": "Bitcoin's decentralized protocol for achieving agreement on its blockchain state. It combines proof-of-work (PoW) mining and the longest-chain rule to secure the network and prevent double-spending."
  },
  "nft-non-fungible-token": {
    "term": "NFT (Non-Fungible Token)",
    "definition": "A unique digital token that represents ownership of a specific item or asset, making it non-interchangeable."
  },
  "node-lightning": {
    "term": "Node (Lightning)",
    "definition": "A computer running Lightning Network software (such as LND, Core Lightning, Eclair, or LDK) that participates in the payment network by opening channels, routing payments, and managing liquidity."
  },
  "non-custodial-wallet": {
    "term": "Non Custodial Wallet",
    "definition": "A type of wallet where the user has full control over their private keys and funds, without relying on a third party. This means the user is solely responsible for the security and management of their bitcoin."
  },
  "nonce": {
    "term": "Nonce",
    "definition": "A 32-bit number in the block header that miners increment while searching for a valid proof-of-work hash. When combined with other header fields and hashed, different nonce values produce different hashes."
  },
  "not-your-keys-not-your-coins": {
    "term": "Not Your Keys, Not Your Coins",
    "definition": "A well-known phrase in Bitcoin, stressing that if you don't control your private keys, you don't truly own your bitcoin. Relying on third parties to hold your keys exposes you to risk, as they could lose or seize your funds. ---"
  },
  "op-return": {
    "term": "OP_RETURN",
    "definition": "An opcode that marks a transaction output as provably unspendable, allowing data to be embedded in transactions without bloating the UTXO set. Since OP_RETURN outputs can never be spent, nodes can safely discard them rather than tracking them forever."
  },
  "opcode": {
    "term": "OPCODE",
    "definition": "A single operation in Bitcoin's stack-based scripting language, used to define spending conditions for transaction outputs. Each opcode performs a specific function: OPDUP duplicates the top stack item, OPHASH160 hashes it, OPCHECKSIG verifies a signature, OPIF enables conditional execution, and so..."
  },
  "onion-routing": {
    "term": "Onion Routing",
    "definition": "A privacy technique used in Lightning Network (via the Sphinx protocol) where payment information is encrypted in multiple layers, like an onion, with each routing node only able to decrypt its layer."
  },
  "off-chain": {
    "term": "Off Chain",
    "definition": "Transactions or data that occur outside of the Bitcoin blockchain. These transactions aren't immediately recorded on-chain but can be settled later. Off-chain activities include the Lightning Network for faster payments and exchanges, where users trade bitcoin without immediate on-chain settlement."
  },
  "on-chain": {
    "term": "On Chain",
    "definition": "Transactions that are recorded directly on the Bitcoin blockchain and broadcast to all nodes. These transactions are publicly verified and included in the next available block."
  },
  "opsec-operations-security": {
    "term": "OPSEC (Operations Security)",
    "definition": "In Bitcoin, the practice of safeguarding personal data and actions to prevent revealing sensitive information, like your identity or private keys, that could compromise your privacy or funds."
  },
  "ordinals": {
    "term": "Ordinals",
    "definition": "A method for assigning unique identifiers to individual satoshis, the smallest units of bitcoin, using the Ordinals protocol. This allows users to inscribe or attach arbitrary data, such as text, images, or other digital assets, directly onto a specific satoshi."
  },
  "orphan-block": {
    "term": "Orphan Block",
    "definition": "A valid block that was mined but is not part of the main chain because another block at the same height was adopted by the network instead. Orphans occur naturally when two miners find blocks nearly simultaneously; the network temporarily has two competing chain tips until one gets extended and..."
  },
  "output": {
    "term": "Output",
    "definition": "A component of a Bitcoin transaction that specifies an amount of Bitcoin and the conditions (locking script or scriptPubKey) required to spend it. Each output represents a new UTXO that can later be used as an input in a future transaction."
  },
  "paper-wallet": {
    "term": "Paper Wallet",
    "definition": "A physical document that contains a Bitcoin private key and its corresponding public address, usually in the form of a QR code. It allows users to store bitcoin offline, providing cold storage."
  },
  "payjoin": {
    "term": "Payjoin",
    "definition": "A privacy technique where both the sender and receiver contribute inputs to a transaction, breaking the common-input-ownership heuristic that blockchain analysis relies on. Normally, analysts assume all inputs to a transaction belong to the same entity. Payjoin defeats this by mixing ownership."
  },
  "peer": {
    "term": "Peer",
    "definition": "Another Bitcoin node that your node maintains a direct TCP connection with for exchanging blocks, transactions, and network information. Nodes typically maintain 8-10 outbound connections (ones they initiated) and accept inbound connections (up to 125 total by default) from other nodes."
  },
  "peer-to-peer-p2p": {
    "term": "Peer-To-Peer (P2P)",
    "definition": "Direct interactions between participants without intermediaries or central authorities. In Bitcoin, this means transactions happen directly between users, with the network enforcing the rules rather than relying on a third party."
  },
  "p2pkh-pay-to-pubkey-hash": {
    "term": "P2PKH (Pay-to-Pubkey-Hash)",
    "definition": "The original and most common legacy Bitcoin script pattern, where funds are locked to the hash of a public key. Addresses start with \"1\" and spending requires providing the full public key and a valid signature."
  },
  "p2sh-pay-to-script-hash": {
    "term": "P2SH (Pay-to-Script-Hash)",
    "definition": "A script pattern (BIP 16) that locks funds to the hash of an arbitrary script, with the actual script only revealed when spending. Addresses start with \"3\" and can encapsulate any valid script, most commonly multisig arrangements or wrapped SegWit."
  },
  "p2tr-pay-to-taproot": {
    "term": "P2TR (Pay-to-Taproot)",
    "definition": "The modern Bitcoin address type introduced with the Taproot upgrade (BIP 341), providing the best combination of privacy, efficiency, and flexibility. Addresses start with \"bc1p\" and can be spent either with a simple key signature (key path) or by revealing one of potentially many script conditions..."
  },
  "p2wpkh-pay-to-witness-pubkey-hash": {
    "term": "P2WPKH (Pay-to-Witness-Pubkey-Hash)",
    "definition": "A native SegWit address type (BIP 141/173) that provides the same security as P2PKH but with lower fees by moving signature data to the witness section. Addresses start with \"bc1q\" followed by 42 characters and use Bech32 encoding for better error detection."
  },
  "p2wsh-pay-to-witness-script-hash": {
    "term": "P2WSH (Pay-to-Witness-Script-Hash)",
    "definition": "A native SegWit address type for complex scripts (like multisig), providing the same capabilities as P2SH but with SegWit's fee discount on witness data. Addresses start with \"bc1q\" but are longer than P2WPKH (62 characters) due to the larger script hash."
  },
  "payment-channel": {
    "term": "Payment Channel",
    "definition": "A mechanism that enables multiple Bitcoin transactions between two parties without broadcasting each one to the blockchain, using a 2-of-2 multisig address as the foundation. Funds are locked in the multisig through an on-chain funding transaction, then balance updates happen off-chain through..."
  },
  "payment-hash": {
    "term": "Payment Hash",
    "definition": "A cryptographic hash of the payment preimage, used in Lightning Network HTLCs to cryptographically link payment attempts across the network. The receiver generates a random preimage and provides its hash to the sender; the payment can only be claimed by revealing the preimage that produces this..."
  },
  "payment-preimage": {
    "term": "Payment Preimage",
    "definition": "A random 32-byte secret generated by the payment recipient that, when hashed, produces the payment hash included in Lightning invoices. The preimage is the \"key\" that unlocks payment."
  },
  "preimage": {
    "term": "Preimage",
    "definition": "The original input data that produces a specific hash output through a cryptographic hash function. In general cryptography, finding a preimage from a hash should be computationally infeasible (preimage resistance)."
  },
  "propagation": {
    "term": "Propagation",
    "definition": "The process by which new blocks and transactions spread across the Bitcoin network from node to node through the gossip protocol. Fast propagation is critical for network security; slow block propagation increases orphan rates and gives advantages to miners with better connectivity."
  },
  "private-key": {
    "term": "Private Key",
    "definition": "A 256-bit secret number that cryptographically proves ownership of associated Bitcoin addresses, enabling the creation of valid signatures to spend funds. Private keys must be generated with sufficient randomness and kept absolutely secure."
  },
  "proof-of-keys": {
    "term": "Proof Of Keys",
    "definition": "The act of withdrawing bitcoin from a third-party exchange into a wallet where you control the private keys. This movement is celebrated annually on January 3rd to promote self-custody and highlight the importance of personal control over your funds."
  },
  "proof-of-work-pow": {
    "term": "Proof-of-Work (PoW)",
    "definition": "The consensus mechanism securing Bitcoin, requiring miners to expend computational resources to find a block hash below a target difficulty threshold. This work is easy to verify but expensive to produce, creating a cost to create blocks that prevents spam and makes chain reorganization..."
  },
  "psbt-partially-signed-bitcoin-transaction": {
    "term": "PSBT (Partially Signed Bitcoin Transaction)",
    "definition": "A standardized format (BIP 174) for creating, transferring, and signing Bitcoin transactions that require multiple steps or multiple signers. PSBTs contain all necessary information (UTXOs, derivation paths, scripts) for signers to validate and sign, then can be combined into a final transaction."
  },
  "protocol": {
    "term": "Protocol",
    "definition": "A set of rules that governs how participants in a network communicate and function. Bitcoin's protocol defines the rules for how transactions are processed, blocks are mined, and consensus is achieved across the network."
  },
  "public-key": {
    "term": "Public Key",
    "definition": "A cryptographic key derived from a private key through one-way elliptic curve multiplication (on the secp256k1 curve), used to verify signatures and generate addresses. Public keys can be safely shared since the mathematical relationship to the private key cannot be reversed."
  },
  "public-key-cryptography": {
    "term": "Public Key Cryptography",
    "definition": "A method of encryption where every private key has a corresponding public key, from which it is impossible to determine the private key, and data encrypted with one key can be decrypted with the other."
  },
  "rbf-replace-by-fee": {
    "term": "RBF (Replace-by-Fee)",
    "definition": "A feature (BIP 125) that allows replacing an unconfirmed transaction with a new version paying higher fees, useful when the original fee was too low for timely confirmation. For RBF to work, the original transaction must signal replaceability (by setting a sequence number below 0xfffffffe), and the..."
  },
  "regtest": {
    "term": "Regtest",
    "definition": "A local regression testing network mode where you can mine blocks instantly with minimal difficulty, creating a private blockchain for development and testing. Unlike testnet or signet, regtest runs entirely on your local machine with no connection to other nodes, giving complete control over block..."
  },
  "relative-time-lock": {
    "term": "Relative Time Lock",
    "definition": "A time lock that prevents a UTXO from being spent until a certain number of blocks or time units have passed since the UTXO itself was confirmed, implemented using OP_CHECKSEQUENCEVERIFY (CSV) and the sequence field."
  },
  "relay": {
    "term": "Relay",
    "definition": "The act of receiving valid blocks or transactions from peers and forwarding them to other connected nodes, which is how information propagates across the decentralized Bitcoin network. Nodes validate data before relaying to prevent spam and invalid data from spreading."
  },
  "ripemd-160": {
    "term": "RIPEMD-160",
    "definition": "A cryptographic hash function that produces a 160-bit (20-byte) output, used in Bitcoin address generation to create shorter addresses while maintaining security. The standard address derivation applies SHA-256 to the public key first, then RIPEMD-160 to that result, producing the 20-byte \"pubkey..."
  },
  "qr-code": {
    "term": "QR Code",
    "definition": "A scannable image often used in Bitcoin to represent a bitcoin address or a Lightning Network invoice. It allows for quick and easy transactions without manually entering long strings of characters."
  },
  "quantum-computing": {
    "term": "Quantum Computing",
    "definition": "A form of computing based on quantum physics. Where classical computers rely on bits (zeros or ones) to make calculations, quantum computers use quantum bits (qubits) that leverage quantum mechanics to exist in a \"superposition\": a combination of zero and one, with some probability for each."
  },
  "rpc-remote-procedure-call": {
    "term": "RPC (Remote Procedure Call)",
    "definition": "The JSON-RPC protocol interface that Bitcoin Core exposes for programmatic interaction, allowing applications to query blockchain data, manage wallets, and create transactions. Common RPC commands include getblockchaininfo, getblock, getrawtransaction, sendrawtransaction, and wallet management..."
  },
  "rgb-really-good-bitcoin": {
    "term": "RGB (Really Good Bitcoin)",
    "definition": "A layer-2 smart contract system designed for creating and managing assets, such as tokens, off-chain while using Bitcoin's security. RGB enables scalable, private, and customizable smart contracts."
  },
  "routing": {
    "term": "Routing",
    "definition": "The process of finding a path through the Lightning Network's channel graph from the payment sender to the recipient. Senders query the network gossip data to build a local graph of channels, then use pathfinding algorithms to find routes with sufficient liquidity and acceptable fees."
  },
  "routing-fee": {
    "term": "Routing Fee",
    "definition": "The fee charged by Lightning nodes for forwarding payments through their channels, compensating them for providing liquidity and taking on channel management costs. Fees consist of two components: a base fee (fixed amount per forwarded payment) and a proportional fee (percentage of the payment..."
  },
  "runes-protocol": {
    "term": "Runes Protocol",
    "definition": "A fungible token standard on Bitcoin, designed to create and manage tokens directly on the Bitcoin blockchain using its UTXO model. Developed by Casey Rodarmor, the creator of Ordinals, it aims to be a more efficient alternative to protocols like BRC-20 by minimizing on-chain footprint and..."
  },
  "sat-satoshi": {
    "term": "Sat (Satoshi)",
    "definition": "A satoshi, or \"sat,\" is the smallest unit of bitcoin, equal to one hundred-millionth of a bitcoin (0.00000001 BTC). Named after Bitcoin's creator, Satoshi Nakamoto, sats are used to measure small amounts of bitcoin."
  },
  "satoshi": {
    "term": "Satoshi",
    "definition": "The smallest unit of Bitcoin, representing 0.00000001 BTC (one hundred millionth of a Bitcoin). Named after Bitcoin's pseudonymous creator, Satoshi Nakamoto, this denomination enables Bitcoin to be used for micropayments despite any future price appreciation."
  },
  "satoshi-nakamoto": {
    "term": "Satoshi Nakamoto",
    "definition": "The pseudonymous creator of Bitcoin. He released the Bitcoin whitepaper in 2008 by mailing it to the Cypherpunk mailing list and mined the Genesis Block in 2009. Satoshi remained active until mid-2010, when he handed over control of Bitcoin's development to others and gradually disappeared."
  },
  "seed-phrase": {
    "term": "Seed Phrase",
    "definition": "A human-readable backup of a wallet's master secret, typically consisting of 12-24 words from a standardized BIP39 wordlist of 2048 words. This mnemonic phrase encodes the entropy used to derive all wallet keys through hierarchical deterministic (HD) derivation, allowing complete wallet recovery..."
  },
  "share": {
    "term": "Share",
    "definition": "A proof-of-work submission from a miner to a mining pool that meets the pool's difficulty target (lower than the actual network difficulty). Shares prove the miner is doing work without requiring them to find actual blocks, enabling fair reward distribution."
  },
  "script": {
    "term": "Script",
    "definition": "Bitcoin's stack-based programming language used to define spending conditions for transaction outputs and provide proofs to satisfy them. Script is intentionally limited (not Turing complete) to ensure all programs terminate and can be analyzed for validity and resource consumption."
  },
  "scriptpubkey": {
    "term": "ScriptPubKey",
    "definition": "The locking script embedded in a transaction output that defines what conditions must be met to spend those funds. Named because it typically involves a public key or its hash, the scriptPubKey is essentially a puzzle that the spender must solve."
  },
  "scriptsig": {
    "term": "ScriptSig",
    "definition": "The unlocking script in a transaction input that provides the data needed to satisfy the referenced output's scriptPubKey conditions. For P2PKH outputs, the scriptSig contains the signature and public key; for P2SH, it contains the serialized redeem script and any necessary signatures."
  },
  "segwit-segregated-witness": {
    "term": "SegWit (Segregated Witness)",
    "definition": "A major protocol upgrade activated in August 2017 (BIP 141) that moves signature data (\"witness\") outside the base transaction structure, fixing several important issues. SegWit resolved transaction malleability (which had blocked Lightning Network development), increased effective block capacity..."
  },
  "sha-256": {
    "term": "SHA-256",
    "definition": "A cryptographic hash function from the SHA-2 family that produces a 256-bit (32-byte) output, used extensively in Bitcoin for proof-of-work, transaction IDs, and block hashing. SHA-256 provides strong security properties: it's computationally infeasible to find an input that produces a specific..."
  },
  "sha256d": {
    "term": "SHA256D",
    "definition": "Double SHA-256 hashing used throughout Bitcoin, where data is hashed twice in succession: SHA256(SHA256(data)). Block headers, transaction IDs, and merkle tree nodes all use SHA256D."
  },
  "schnorr-signature": {
    "term": "Schnorr Signature",
    "definition": "A digital signature scheme (BIP 340) introduced with Taproot that offers several advantages over the previously-used ECDSA. Schnorr signatures are mathematically simpler, provably secure under standard assumptions, and enable powerful features like signature aggregation (combining multiple..."
  },
  "selfish-mining": {
    "term": "Selfish Mining",
    "definition": "An attack strategy where a miner with significant hash power secretly mines blocks without broadcasting them, then strategically releases them to orphan honest miners' blocks. By withholding blocks and timing releases, an attacker can potentially earn more than their proportional share of hash..."
  },
  "silent-payments": {
    "term": "Silent Payments",
    "definition": "A privacy protocol (BIP 352) enabling recipients to publish a static identifier from which senders can derive unique, unlinkable addresses for each payment. This solves the address reuse problem without requiring interaction, as the recipient doesn't need to generate and share new addresses for..."
  },
  "signet": {
    "term": "Signet",
    "definition": "A test network (BIP 325) that adds a signature requirement to block validity, enabling more controlled and realistic testing than regtest while avoiding testnet's issues with griefing and worthless coins."
  },
  "soft-fork": {
    "term": "Soft Fork",
    "definition": "A backward-compatible protocol change that tightens consensus rules, making some previously valid transactions or blocks now invalid. Non-upgraded nodes continue accepting new blocks but may not understand new features (they see transactions as \"anyone can spend\" but observe miners not spending..."
  },
  "sidechain": {
    "term": "Sidechain",
    "definition": "A separate blockchain that's interoperable with Bitcoin, allowing bitcoin to move between the two chains via two-way pegs. Sidechains can offer additional features or scalability while using Bitcoin as the base layer for security."
  },
  "signature": {
    "term": "Signature",
    "definition": "A digital signature in a Bitcoin transaction proves that the owner of the corresponding private key authorized the transaction. It ensures the authenticity and security of the transfer."
  },
  "smart-contracts": {
    "term": "Smart Contracts",
    "definition": "Self-executing contracts where the terms are written in code rather than legal text. They automatically execute on blockchains when predefined conditions are met. While not native to Bitcoin, smart contracts can be implemented on Bitcoin through sidechains or other solutions."
  },
  "sphinx-protocol": {
    "term": "Sphinx Protocol",
    "definition": "The onion routing protocol used in Lightning Network to provide payment privacy, where route information is encrypted in layers like an onion. The sender constructs the entire encrypted packet, with each routing node only able to decrypt their layer to learn the next hop."
  },
  "spv-simplified-payment-verification": {
    "term": "SPV (Simplified Payment Verification)",
    "definition": "A method described in the Bitcoin whitepaper for lightweight clients to verify transactions without downloading the full blockchain, relying on merkle proofs and block headers. SPV clients download only block headers (~80 bytes each vs."
  },
  "stale-blocks": {
    "term": "Stale Blocks",
    "definition": "Valid blocks that were mined but not accepted into the blockchain because another block at the same height was added to the chain first. These blocks become disconnected from the timechain."
  },
  "store-of-value": {
    "term": "Store Of Value",
    "definition": "An asset that preserves its purchasing power over time. People use it to maintain wealth and protect against inflation. Gold and Bitcoin are often viewed as stores of value because they are resistant to inflation and currency devaluation, unlike fiat money, which loses value over time."
  },
  "stratum": {
    "term": "Stratum",
    "definition": "The de facto standard protocol for communication between Bitcoin miners and mining pools, enabling work distribution and share submission. Stratum v1 has pools send work (block header template and target) to miners, who submit shares (valid proofs of work)."
  },
  "stratum-v2": {
    "term": "Stratum V2",
    "definition": "An upgraded communication protocol for Bitcoin mining pools that improves efficiency, security, and decentralization. It allows miners more control over the construction of block templates and reduces the risk of centralization in mining pools."
  },
  "sybil-attack": {
    "term": "Sybil Attack",
    "definition": "An attack where a malicious actor creates many fake identities (nodes) to gain disproportionate influence over the network, potentially to eclipse victims from honest nodes or manipulate peer discovery."
  },
  "taproot": {
    "term": "Taproot",
    "definition": "A major Bitcoin protocol upgrade activated in November 2021 (BIPs 340, 341, 342) that significantly improves privacy, efficiency, and smart contract capabilities. Taproot combines Schnorr signatures, MAST (Merkle Abstract Syntax Trees), and a new script version to make complex transactions..."
  },
  "testnet": {
    "term": "Testnet",
    "definition": "A public Bitcoin network using worthless test coins, designed for development and testing without risking real money. Testnet uses different address prefixes (starting with \"m\", \"n\", \"2\", or \"tb1\") and different genesis block, ensuring testnet and mainnet transactions can never be confused."
  },
  "time-lock": {
    "term": "Time Lock",
    "definition": "A mechanism built into Bitcoin transactions that prevents funds from being spent until specified conditions are met, enabling time-based smart contracts. Absolute time locks (CLTV) prevent spending until a specific block height or Unix timestamp."
  },
  "tlv-type-length-value": {
    "term": "TLV (Type-Length-Value)",
    "definition": "A flexible encoding format used extensively in Lightning Network protocol messages (BOLT specifications) that allows for extensible and forward-compatible data structures. Each TLV record contains a type identifier (what kind of data), a length (how many bytes), and the value itself."
  },
  "transaction": {
    "term": "Transaction",
    "definition": "The fundamental unit of value transfer in Bitcoin, consisting of inputs (references to previously unspent outputs being consumed), outputs (new UTXOs being created with specified amounts and spending conditions), and metadata."
  },
  "transaction-fee": {
    "term": "Transaction Fee",
    "definition": "The amount paid to miners as incentive for including a transaction in a block, calculated as the difference between total input value and total output value. Fees are paid in satoshis and typically expressed as a fee rate (satoshis per virtual byte) to account for transaction size."
  },
  "transaction-id-txid": {
    "term": "Transaction ID (TXID)",
    "definition": "A unique 256-bit identifier for a transaction, calculated as the SHA256D hash of the serialized transaction data. TXIDs are used to reference transactions in inputs (specifying which output to spend), in block merkle trees, and throughout the ecosystem for tracking and identification."
  },
  "transaction-malleability": {
    "term": "Transaction Malleability",
    "definition": "A historical vulnerability where transaction signatures could be modified by third parties without invalidating them, causing the transaction ID to change even though the transaction itself remained valid."
  },
  "triple-entry-bookkeeping": {
    "term": "Triple Entry Bookkeeping",
    "definition": "An advancement of traditional double-entry bookkeeping that incorporates cryptographic verification. In Bitcoin, each transaction is logged in a decentralized ledger (the blockchain), where all participants can verify the transaction."
  },
  "utxo-unspent-transaction-output": {
    "term": "UTXO (Unspent Transaction Output)",
    "definition": "A transaction output that hasn't been spent yet, representing the actual \"coins\" in Bitcoin's accounting model. Unlike account-based systems (like bank accounts), Bitcoin tracks ownership through discrete UTXOs. Each is either entirely unspent or entirely consumed when used as an input."
  },
  "utxo-set": {
    "term": "UTXO Set",
    "definition": "The complete database of all unspent transaction outputs at a given point in time, representing the current state of Bitcoin ownership. Full nodes maintain the UTXO set in memory or fast storage for quick transaction validation, checking that referenced inputs exist and aren't already spent."
  },
  "unconfirmed-transaction": {
    "term": "Unconfirmed Transaction",
    "definition": "A transaction which is not yet part of a block. A confirmation is when a transaction is put into a block to permanently become part of the blockchain. \"6 confirmations\" means that the transaction is in a block and there are 5 blocks after it in the chain, which provides added assurance that the..."
  },
  "unit-of-account": {
    "term": "Unit Of Account",
    "definition": "One of the three primary functions of money, alongside being a medium of exchange and a store of value. It refers to money's ability to provide a consistent standard for measuring and comparing the value of goods and services. ---"
  },
  "vbyte-virtual-byte": {
    "term": "vByte (Virtual Byte)",
    "definition": "A unit of transaction size measurement introduced with SegWit, calculated as weight units divided by 4, used for fee calculation and block space accounting. Virtual bytes provide backward compatibility with legacy fee estimation while incorporating SegWit's discount for witness data."
  },
  "virgin-bitcoin": {
    "term": "Virgin Bitcoin",
    "definition": "Newly mined bitcoin that has never been used in any transactions. It is untainted by any transaction history and is sometimes valued more due to its clean transaction record. ---"
  },
  "wallet": {
    "term": "Wallet",
    "definition": "Software (or hardware) that manages Bitcoin private keys, tracks balances, and creates transactions on behalf of the user. Wallets can be full node (run their own node for verification), SPV (trust others for block validation), or custodial (third party holds keys)."
  },
  "watchtower": {
    "term": "Watchtower",
    "definition": "A service that monitors the Bitcoin blockchain on behalf of Lightning Network users, watching for attempts to close channels with outdated (fraudulent) states. When a channel counterparty broadcasts a revoked commitment transaction while you're offline, the watchtower detects it and broadcasts a..."
  },
  "weight-units": {
    "term": "Weight Units",
    "definition": "The measurement system introduced by SegWit for calculating transaction size and block capacity, where base transaction data counts as 4 weight units per byte and witness data counts as 1 weight unit per byte."
  },
  "witness": {
    "term": "Witness",
    "definition": "The segregated data structure in SegWit transactions containing signatures, public keys, and other unlocking data that proves authorization to spend inputs. By moving witness data outside the base transaction (and thus outside the TXID calculation), SegWit fixed transaction malleability and enabled..."
  },
  "witness-discount": {
    "term": "Witness Discount",
    "definition": "A feature introduced in Bitcoin's SegWit upgrade, which reduces the cost of storing certain types of data, specifically witness data, by giving it a lower \"weight\" in terms of transaction fees."
  },
  "zmq-zeromq": {
    "term": "ZMQ (ZeroMQ)",
    "definition": "A high-performance messaging library integrated into Bitcoin Core that provides real-time publish-subscribe notifications for new blocks, transactions, and other events. Applications can subscribe to ZMQ topics (like \"rawtx\" for new transactions or \"hashblock\" for new blocks) and receive instant..."
  },
  "xbt": {
    "term": "XBT",
    "definition": "The ISO currency code for bitcoin. Like XAU for gold, \"X\" is used to indicate a currency that isn't tied to any specific country, in contrast to BTC, the commonly used ticker symbol."
  },
  "xpub-extended-public-key": {
    "term": "xPub (Extended Public Key)",
    "definition": "An extended public key used by Hierarchical Deterministic (HD) wallets to generate multiple public addresses from one master key. This allows you to receive bitcoin while keeping your private keys securely offline."
  },
  "ypub": {
    "term": "Ypub",
    "definition": "An extended public key format used in BIP49 wallets to generate SegWit addresses wrapped in P2SH. Unlike an Xpub, which is used for legacy P2PKH addresses, a Ypub derives addresses that start with \"3,\" offering lower transaction fees while maintaining compatibility with older wallets."
  },
  "zero-confirmation-transaction": {
    "term": "Zero Confirmation Transaction",
    "definition": "A Bitcoin transaction that has been broadcasted to the network but hasn't yet been confirmed by miners and included in a block. It's considered riskier because it can still be reversed."
  },
  "zero-knowledge-proof-zkp": {
    "term": "Zero Knowledge Proof (ZKP)",
    "definition": "A cryptographic method that allows one party (the prover) to prove to another party (the verifier) that they know a specific piece of information or that a statement is true, without revealing the information itself."
  },
  "zk-snark-zero-knowledge-succinct-non-interactive-argument-of-knowledge": {
    "term": "zk-SNARK (Zero-Knowledge Succinct Non-Interactive Argument of Knowledge)",
    "definition": "A cryptographic proof that allows one party to prove it has certain information without revealing the information itself. While zk-SNARKs are not used in Bitcoin, they are employed in other blockchain projects for privacy-focused transactions."
  },
  "zk-starks-zero-knowledge-scalable-transparent-arguments-of-knowledge": {
    "term": "zk-STARKs (Zero-Knowledge Scalable Transparent Arguments of Knowledge)",
    "definition": "Cryptographic proofs that allow a prover to demonstrate possession of certain information without revealing the information itself. This enables secure verification of computations or transactions while keeping the details private."
  }
}